"""
---- Додавання даних у таблицю бази даних mysql
"""

import mysql.connector

# Підключення до бази даних «назва_вашої_бази_даних»
mydb = mysql.connector.connect(
  host="localhost",
  user="ім'я",
  password="пароль",
  database="назва_вашої_бази_даних"
)

mycursor = mydb.cursor()

# Підготовка колонок «країна» та «столиця» до додавання їм рядків
sql = "INSERT INTO назва_вашої_таблиці (країна, столиця) VALUES (%s, %s)"
# Список кортежів з рядками даних, який ми додамо до таблиці. Перший аргумент - країна, другий - столиця
val = [
  ("Україна", "Київ"),
  ("Англія", "Лондон"),
  ("Польща", "Варшава")
]
# Якщо ви хочете додати лиш один кортеж, то можете змінити значення змінної val на таке ("Україна", "Київ")

# Додавання рядків до колонок
mycursor.executemany(sql, val)
mydb.commit()

# Порахувати кількість рядків
print(mycursor.rowcount)
